---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.MultistoryLevelBelowTopbottomLevelError
source: html/fe0412f8-bc36-5db2-724f-c51efc5e5953.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.MultistoryLevelBelowTopbottomLevelError Property

Multistory top level must be above the stair/ramp top and bottom levels.

## Syntax (C#)
```csharp
public static FailureDefinitionId MultistoryLevelBelowTopbottomLevelError { get; }
```